In [1]:
import math
import os
import random
import re
import sys

In [2]:
# Complete the compareTriplets function below.
def compareTriplets(a, b):
    Alice = 0
    Bob = 0
    if a[0] > b[0]:
        Alice = Alice + 1
    if a[0] < b[0]:
        Bob = Bob + 1
    if a[1] > b[1]:
        Alice = Alice + 1
    if a[1] < b[1]:
        Bob = Bob + 1
    if a[2] > b[2]:
        Alice = Alice + 1
    if a[2] < b[2]:
        Bob = Bob + 1
    return Alice, Bob

In [3]:
a = [5, 6, 7]
b = [3, 6, 10]

In [4]:
compareTriplets(a,b)

(1, 1)

In [5]:
a = [17, 28, 30]
b = [99, 16, 8]

In [6]:
compareTriplets(a,b)

(2, 1)

In [7]:
a = [17, 28, 30]
b = [17, 16, 8]

In [8]:
compareTriplets(a,b)

(2, 0)

In [9]:
def aVeryBigSum(n, ar):
    sum = 0
    for i in range(len(ar)):
        sum+=ar[i]
    return sum

In [10]:
ar = [1000000001, 1000000002, 1000000003, 1000000004, 1000000005]

In [11]:
aVeryBigSum(5, ar)

5000000015

# SQL Practice

![image](city_hacker_rank.png)

Query all columns for a city in CITY with the ID 1661.

- Select *
- From CITY
- Where ID = 1661

Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

- SELECT *
- From CITY
- WHERE COUNTRYCODE = 'JPN';

Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

- Select Name 
- From CITY
- Where COUNTRYCODE = 'JPN';

![station](station_hacker_rank.png)

Query a list of CITY names from STATION for cities that have an even ID number. Print the results in any order, but exclude duplicates from the answer.

- Select Distinct CITY
- FROM STATION
- Where mod(ID,2) = 0
- Order by CITY DESC;

Find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.

- SELECT COUNT(City) - COUNT(DISTINCT City) 
- FROM STATION;

Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

- SELECT CITY,LENGTH(CITY)
- FROM STATION
- WHERE LENGTH(CITY) IN (
    >-  SELECT MAX(LENGTH(CITY))
    >-  FROM STATION
    >- UNION
    >- SELECT MIN(LENGTH(CITY))
    >- FROM STATION)
    >- ORDER BY LENGTH(CITY) DESC,CITY ASC LIMIT 2;

Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

- SELECT CITY
- FROM STATION
- Where CITY REGEXP '^[aeiou]';

Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

- SELECT DISTINCT CITY 
- FROM STATION 
- WHERE CITY REGEXP '[aeiou]$'

Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

- Select Distinct city
- From   station
- Where  REGEXP_LIKE(city,'[aeiou].*[aeiou]')

Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.
- SELECT DISTINCT city
- FROM   station
- WHERE  city RLIKE '^[aeiouAEIOU].*[aeiouAEIOU]$'

Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.

- SELECT DISTINCT CITY 
- FROM STATION 
- WHERE CITY RLIKE '^[^aeiou].*'

Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.

- SELECT DISTINCT (CITY) 
- FROM STATION 
- WHERE NOT regexp_like(lower(CITY),'[aeiou]$');

Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels. Your result cannot contain duplicates.

- SELECT DISTINCT CITY
- FROM STATION
- WHERE (NOT(CITY  Like 'A%' OR CITY LIKE 'E%' OR CITY LIKE 'O%' OR CITY LIKE 'I%' OR CITY LIKE 'U%'))
- 		OR 
- 	  (NOT (CITY LIKE '%a' OR CITY  LIKE '%e' OR CITY LIKE '%i' OR CITY LIKE '%o' OR CITY LIKE '%u'))
- ORDER BY CITY;

Query the list of CITY names from STATION that do not start with vowels and do not end with vowels. Your result cannot contain duplicates.

- SELECT DISTINCT CITY 
- FROM STATION 
- WHERE CITY REGEXP '^[^aeiou].*[^aeiou]$';

![student](student_input_haker_rank.png)

![student](sudent_format.png)

Query the Name of any student in STUDENTS who scored higher than  Marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID.

- SELECT Name
- FROM STUDENTS
- WHERE Marks > 75
- ORDER BY RIGHT(NAME, 3), ID ASC

Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order

- Select name
- From Employee
- Order by name

![employee](employee_hacker_rank.png)

Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than $2000 per month who have been employees for less than  months. Sort your result by ascending employee_id.

- Select name
- from EMPLOYEE
- Where salary > 2000 AND months < 10
- ORDER BY employee_id;

SELECT c.company_code, c.founder, 
       COUNT(DISTINCT l.lead_manager_code), COUNT(DISTINCT s.senior_manager_code),
       COUNT(DISTINCT m.manager_code), COUNT(DISTINCT e.employee_code)
FROM Company c, Lead_Manager l, Senior_Manager s, Manager m, Employee e
WHERE c.company_code = l.company_code AND 
      l.lead_manager_code = s.lead_manager_code AND
      s.senior_manager_code = m.senior_manager_code AND
      m.manager_code = e.manager_code
GROUP BY c.company_code, c.founder ORDER BY c.company_code;

Samantha was tasked with calculating the average monthly salaries for all employees in the EMPLOYEES table, but did not realize her keyboard's 0 key was broken until after completing the calculation. She wants your help finding the difference between her miscalculation (using salaries with any zeroes removed), and the actual average salary.
Write a query calculating the amount of error (i.e.: actual-miscaluclated) average monthly salaries), and round it up to the next integer.




__SELECT CEIL(AVG(Salary) - AVG(REPLACE(Salary, '0', ''))) FROM EMPLOYEES;__

Query the Western Longitude (LONG_W) for the largest Northern Latitude (LAT_N) in STATION that is less than . Round your answer to  decimal places.

__SELECT ROUND(LONG_W, 4)
FROM STATION
WHERE LAT_N < 137.2345 
ORDER BY LAT_N DESC LIMIT 1;__

![manhattan](manhattan_distance.png)

__SELECT ROUND(ABS(MIN(LAT_N)-MAX(LAT_N)) + ABS(MIN(LONG_W)-MAX(LONG_W)), 4) FROM STATION;__

![euclidean](![euclidean_distance.png](euclidean_distance.png)

__SELECT ROUND(SQRT(POW(MIN(LAT_N)-MAX(LAT_N), 2) + POW(MIN(LONG_W)-MAX(LONG_W), 2)), 4) 
FROM STATION;__